/******************************************************************************

 ============ C10 ===================
    Простые множители
    Составить функцию, печать всех простых множителей числа. Использовать ее для печати всех простых множителей числа.<br/>
<b>void print_simple(int n)</b>


*******************************************************************************/
#include <stdio.h>

void printsimple(int in) //"Решето Эратосфена"
{
    int div = 2; //Начальное значение делителя = 2, первое простое число.
    while (in > 1) 
    {
        if (in % div == 0)
        {
            printf("%d ", div);
            in = in / div;
        }
        else 
        {
            div++;
        }
    }
}

int main()
{
    int in;
    printf("Введите целое число\n");
    scanf("%d", &in);
    printsimple (in);
    return 0;
}
